---
kind: type
id: T:Autodesk.Revit.DB.ExtensibleStorage.DataStorage
source: html/015081b6-3a45-1b4c-991a-93419e9acd51.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.DataStorage

An element which allows an API applications to organize and store data.

## Syntax (C#)
```csharp
public class DataStorage : Element
```

## Remarks
Applications can create instances of these elements to logically organize
 different sets of ExtensibleStorage entities into separate elements.
 This allows an application to update one set of data in a local
 workshared project without locking other elements.